{
  "Title": "Weatherizing Your Home For Winter 2021",
  "Body": "Insulation is the perfect place to start when it comes to weatherizing your home. A well-insulated home can significantly reduce your heating and cooling bills throughout the year and will keep your home at a more consistent temperature, keeping you comfortable year-round. Although you may not notice it, there are many common trouble areas in homes where air can freely pass between outdoor and indoor air. This air leakage occurs when outside air enters and your conditioned indoor air leaves your house uncontrollably through cracks and openings. This is where insulation comes into play. Through the proper use of insulation, you can combat the majority of leaks throughout your home. On average, homes with insulation save up to 20% on their heating and cooling costs, and by adding insulation to attics, floors, crawl spaces, accessible basement rim joints, and other problem areas for leaks, you can save up to 10% on your total energy costs.  Types of Insulation There are six types of insulation on the market that serve their respective purposes depending on the problem area. Those six types of insulation are Blankets, including batts and rolls. Blankets, including batts and rolls, are the most common types of insulating in the United States. If you have seen the big pink rolls of insulation, those are a type of blanket insulation. However, there are more variants of blanket insulation than just the big pink rolls. Loose Fill Loose-fill insulation is a type of insulation that is adaptable and can conform to any space without disturbing structures or finishes. Sprayed or foamed-in-place insulation is a type of insulation that is best for filling small cavities.Rigid insulation is a type of insulation commonly used from the roof to the foundation, and it reduces energy loss through the house frame. Reflective insulation is the most effective in reducing downward heat flow. Radiant Barrier Insulation is very useful in hot, sunny climates because it helps keep the home cooler.",
  "URL": "https://www.poweredbyefi.org/xcelenergyco/blog/weatherizing-your-home-for-winter-2021.html"
}